Revit 2027 API
BuiltInFailures.RoomFailures.OptionConflictRoomOverlapMain Property
 Option Conflict between Rooms.\nRoom in Option '[Option Name]' overlaps Room in the Main Model.\nTo resolve, select the Main Model Room and use the Add to Design Option Set command.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId OptionConflictRoomOverlapMain { get; }
Public Shared ReadOnly Property OptionConflictRoomOverlapMain As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ OptionConflictRoomOverlapMain {
	FailureDefinitionId^ get ();
}
static member OptionConflictRoomOverlapMain : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RoomFailures Class
Autodesk.Revit.DB Namespace